--- a/test-diagram.md
+++ b/test-diagram.md
@@ -4,21 +4,21 @@
 
 ```mermaid
 graph TD
@@
+    0[input nth]
+    --> 1[n += 1]
+    --> 2{{circular_p_digit}}
+        --> 1
         2--T
-    --> 3{check prime}
-        --F--> 92
+    --> 3{{isPrime}}
+        --> 1
         3--T
-    --> 4{check rotate}
-        --F--> 92
+    --> 4{{circular_p_rotate}}
+        --> 1
         4--T
-    --> 90[rtn: n]
+    --> 6{{nth circular prime}}
+        --> 1
+        6--T
+    --> 9[return n]
 ```
 
 ---
@@ -33,62 +33,51 @@ graph TD
 ```puml
 start
 
-- n
-if (check int) then
-        stop
-    else (T)
-if (check digit) then
-        stop
-    else (T)
-if (check prime) then
-        stop
-    else (T)
-if (check rotate) then
-        stop
-    else (T)
-- n
+-> input nth;
+- circular_p_digit
+- isPrime
+- circular_p_rotate
 
+-> return n;
 stop
 ```
-
----
 
